_posts/other/2016-09-09-二进制文件格式设计.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-09-09 五 17:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="steven" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. 二进制文件设计</a>
<ul>
<li><a href="#orgheadline1">1.1. 为什么要写这个总结呢？</a></li>
<li><a href="#orgheadline2">1.2. 正确的编码格式应该是什么样的？</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> 二进制文件设计</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 为什么要写这个总结呢？</h3>
<div class="outline-text-3" id="text-1-1">
<p>
下午想对着行车记录仪的上报规范重新写一下Head文件的解析；
因为之前对老版本的文件已经写过一个数据解析的程序，但是新版本的调整感觉需要将整个代码再重新搞一遍；
</p>

<p>
这让我越写越有点生气，刚才发了一个邮件让他们重新找个一个更好的数据交换方式：
</p>

<p>
为什么我感到痛苦，我给你解释一下看看你就了解了！
供应商的文件原来是head+body是一个文件：
字段的形式如下
</p>
<div class="org-src-container">

<pre class="src src-txt">老板的格式如下：
|field1|field2|field3|....|reverse|body|

新版本的格式如下：
|field3|field1|...|resverse|
</pre>
</div>

<p>
新版本不但删除了一些字段，而且老的字段也发生了改变，而且有些字段长度也变化了，我在解析的时候，需要重新调整代码的字段意义；
以及每个字段的长度；
</p>

<p>
供应商虽然把这些变化写到文档里面了，尼玛，你也不能让老子每次对着你的文档重新给你改一遍吧；
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 正确的编码格式应该是什么样的？</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="http://hjcapple.github.io/2016/03/31/binary-format.html">http://hjcapple.github.io/2016/03/31/binary-format.html</a>
<a href="http://stackoverflow.com/questions/323604/what-are-important-points-when-designing-a-binary-file-format">http://stackoverflow.com/questions/323604/what-are-important-points-when-designing-a-binary-file-format</a>
</p>

<p>
即时我们可以不用protobuf，但是二进制文件设计的时候是不是有更好的形式呢？
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">字节</th>
<th scope="col" class="org-left">Magic</th>
<th scope="col" class="org-left">RecorderID</th>
<th scope="col" class="org-left">Ver</th>
<th scope="col" class="org-left">Tag</th>
<th scope="col" class="org-left">Length</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">&#x2026;</th>
<th scope="col" class="org-left">Tag</th>
<th scope="col" class="org-left">Length</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Pad</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">长度</td>
<td class="org-left">4</td>
<td class="org-left">32</td>
<td class="org-left">4</td>
<td class="org-left">1</td>
<td class="org-left">4</td>
<td class="org-left">Length</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1</td>
<td class="org-left">4</td>
<td class="org-left">Length</td>
<td class="org-left">108</td>
</tr>

<tr>
<td class="org-left">意义</td>
<td class="org-left">魔数</td>
<td class="org-left">wifimac</td>
<td class="org-left">协议版本</td>
<td class="org-left">字段类型</td>
<td class="org-left">字段长度</td>
<td class="org-left">字段值</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">字段类型</td>
<td class="org-left">字段长度</td>
<td class="org-left">字段值</td>
<td class="org-left">保留字段</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
当然了，这种格式里面也没有写具体的大头、小头，需要在对应的文档里面备注，但是这种方式相对而言交互性更好一些不是吗？
我也不知道供应商怎么想的，要是我们变更需要加个字段，他们就给加上了，有没有考虑到后面解析的人的问题？
</p>

<p>
总结，这样的供应商还能有市场，说明了啥？
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: steven</p>
<p class="date">Created: 2016-09-09 五 17:58</p>
<p class="validation"></p>
</div>
</body>
</html>
